#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Reading...
module.dynamodb_billing_enforcer[0].data.archive_file.enforcer_lambda: Read complete after 0s [id=f376f1c2968b21f6d2558489c4bd7d1a58c683a3]
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]
module.service_quotas.aws_servicequotas_template.ec2_dl_vcpus["us-east-1"]: Refreshing state... [id=us-east-1,L-6E869C2A,ec2]
module.service_quotas.aws_servicequotas_template.ebs_snapshots["us-west-2"]: Refreshing state... [id=us-west-2,L-309BACF6,ebs]
module.service_quotas.aws_servicequotas_template.ebs_snapshots["us-east-1"]: Refreshing state... [id=us-east-1,L-309BACF6,ebs]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Reading...
module.scp_manager.aws_organizations_policy.cost_avoidance: Refreshing state... [id=p-ozmh7axs]
module.service_quotas.aws_servicequotas_template.ec2_dl_vcpus["us-west-2"]: Refreshing state... [id=us-west-2,L-6E869C2A,ec2]
module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-east-1"]: Refreshing state... [id=us-east-1,L-34B43A08,ec2]
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Reading...
module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-west-2"]: Refreshing state... [id=us-west-2,L-B99A9384,lambda]
module.cost_anomaly_detection[0].data.aws_caller_identity.current: Read complete after 0s [id=955063685555]
module.service_quotas.aws_servicequotas_template.lambda_concurrent_executions["us-east-1"]: Refreshing state... [id=us-east-1,L-B99A9384,lambda]
module.service_quotas.aws_servicequotas_template.nat_gateways["us-west-2"]: Refreshing state... [id=us-west-2,L-FE5A380F,vpc]
module.scp_manager.aws_organizations_policy.restrictions: Refreshing state... [id=p-6tw8eixp]
module.service_quotas.aws_servicequotas_template.ec2_spot_vcpus["us-west-2"]: Refreshing state... [id=us-west-2,L-34B43A08,ec2]
module.service_quotas.aws_servicequotas_template.nat_gateways["us-east-1"]: Refreshing state... [id=us-east-1,L-FE5A380F,vpc]
module.dynamodb_billing_enforcer[0].aws_iam_role.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
module.service_quotas.aws_servicequotas_template.alb_count["us-east-1"]: Refreshing state... [id=us-east-1,L-53DA6B97,elasticloadbalancing]
module.service_quotas.aws_servicequotas_template.alb_count["us-west-2"]: Refreshing state... [id=us-west-2,L-53DA6B97,elasticloadbalancing]
module.cost_anomaly_detection[0].aws_ce_anomaly_monitor.linked_accounts[0]: Refreshing state... [id=arn:aws:ce::955063685555:anomalymonitor/6bc1d6c1-9ce8-4792-af26-0b4e85228b1c]
module.service_quotas.aws_servicequotas_template_association.sandbox[0]: Refreshing state... [id=955063685555]
module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_rule.dynamodb_table_changes: Refreshing state... [id=ndx-dynamodb-billing-enforcer]
data.aws_organizations_organizational_unit_descendant_accounts.sandbox_pool[0]: Read complete after 0s [id=ou-2laj-sre4rnjs]
module.budgets[0].aws_iam_role.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions]
module.cost_anomaly_detection[0].aws_sns_topic.cost_anomaly_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts]
module.budgets[0].aws_sns_topic.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.scp_manager.aws_organizations_policy_attachment.cost_avoidance: Refreshing state... [id=ou-2laj-sre4rnjs:p-ozmh7axs]
module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services: Refreshing state... [id=ou-2laj-4dyae1oa:p-7pd0szg9]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[1]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:9d1f7fcc-5914-45ee-88c5-0e7e9da7f6e0]
module.cost_anomaly_detection[0].aws_sns_topic_policy.cost_anomaly_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[2]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:6aa4a142-c55b-4842-b027-33445a05fa86]
module.cost_anomaly_detection[0].aws_sns_topic_subscription.email[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts:c292863b-a7ea-48bc-8d25-295fde17c607]
module.budgets[0].aws_sns_topic_policy.budget_alerts[0]: Refreshing state... [id=arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-404584456509]
module.budgets[0].aws_budgets_budget.daily_cost_per_account["982203978489"]: Refreshing state... [id=955063685555:ndx-sandbox-daily-982203978489]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["404584456509"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-404584456509]
module.budgets[0].aws_budgets_budget.monthly_cost_per_account["982203978489"]: Refreshing state... [id=955063685555:ndx-sandbox-monthly-982203978489]
module.budgets[0].aws_budgets_budget.service["dynamodb"]: Refreshing state... [id=955063685555:ndx-sandbox-dynamodb-daily]
module.budgets[0].aws_budgets_budget.service["data_transfer"]: Refreshing state... [id=955063685555:ndx-sandbox-data-transfer-daily]
module.budgets[0].aws_budgets_budget.service["ec2"]: Refreshing state... [id=955063685555:ndx-sandbox-ec2-daily]
module.budgets[0].aws_budgets_budget.service["apigateway"]: Refreshing state... [id=955063685555:ndx-sandbox-apigateway-daily]
module.budgets[0].aws_budgets_budget.service["stepfunctions"]: Refreshing state... [id=955063685555:ndx-sandbox-stepfunctions-daily]
module.budgets[0].aws_budgets_budget.service["bedrock"]: Refreshing state... [id=955063685555:ndx-sandbox-bedrock-daily]
module.budgets[0].aws_budgets_budget.service["rds"]: Refreshing state... [id=955063685555:ndx-sandbox-rds-daily]
module.budgets[0].aws_budgets_budget.service["cloudwatch"]: Refreshing state... [id=955063685555:ndx-sandbox-cloudwatch-daily]
module.budgets[0].aws_budgets_budget.service["lambda"]: Refreshing state... [id=955063685555:ndx-sandbox-lambda-daily]
module.budgets[0].aws_budgets_budget.service["s3"]: Refreshing state... [id=955063685555:ndx-sandbox-s3-daily]
module.dynamodb_billing_enforcer[0].aws_iam_role_policy.enforcer_lambda: Refreshing state... [id=ndx-dynamodb-billing-enforcer:ndx-dynamodb-billing-enforcer-policy]
module.budgets[0].aws_iam_role_policy.budget_actions[0]: Refreshing state... [id=ndx-sandbox-budget-actions:ndx-sandbox-budget-actions-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cost_anomaly_detection[0].aws_ce_anomaly_monitor.main will be created
  + resource "aws_ce_anomaly_monitor" "main" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + monitor_dimension = "SERVICE"
      + monitor_type      = "DIMENSIONAL"
      + name              = "ndx-cost-anomaly-monitor"
      + tags              = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-monitor"
        }
      + tags_all          = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-monitor"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.high_priority[0] will be created
  + resource "aws_ce_anomaly_subscription" "high_priority" {
      + account_id       = (known after apply)
      + arn              = (known after apply)
      + frequency        = "IMMEDIATE"
      + id               = (known after apply)
      + monitor_arn_list = (known after apply)
      + name             = "ndx-high-priority-anomaly-subscription"
      + tags             = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-high-priority-anomaly-subscription"
        }
      + tags_all         = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-high-priority-anomaly-subscription"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }

      + subscriber {
          + address = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
          + type    = "SNS"
        }

      + threshold_expression {
          + dimension {
              + key           = "ANOMALY_TOTAL_IMPACT_ABSOLUTE"
              + match_options = [
                  + "GREATER_THAN_OR_EQUAL",
                ]
              + values        = [
                  + "50",
                ]
            }
        }
    }

  # module.cost_anomaly_detection[0].aws_ce_anomaly_subscription.main will be created
  + resource "aws_ce_anomaly_subscription" "main" {
      + account_id       = (known after apply)
      + arn              = (known after apply)
      + frequency        = "DAILY"
      + id               = (known after apply)
      + monitor_arn_list = (known after apply)
      + name             = "ndx-cost-anomaly-subscription"
      + tags             = {
          + "Component" = "Cost-Anomaly-Detection"
          + "Name"      = "ndx-cost-anomaly-subscription"
        }
      + tags_all         = {
          + "Component"   = "Cost-Anomaly-Detection"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ndx-cost-anomaly-subscription"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }

      + subscriber {
          + address = "arn:aws:sns:us-east-1:955063685555:ndx-cost-anomaly-alerts"
          + type    = "SNS"
        }

      + threshold_expression {
          + dimension {
              + key           = "ANOMALY_TOTAL_IMPACT_ABSOLUTE"
              + match_options = [
                  + "GREATER_THAN_OR_EQUAL",
                ]
              + values        = [
                  + "10",
                ]
            }
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_event_target.invoke_enforcer_lambda will be created
  + resource "aws_cloudwatch_event_target" "invoke_enforcer_lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "us-east-1"
      + rule           = "ndx-dynamodb-billing-enforcer"
      + target_id      = "InvokeEnforcerLambda"
    }

  # module.dynamodb_billing_enforcer[0].aws_cloudwatch_log_group.enforcer_lambda will be created
  + resource "aws_cloudwatch_log_group" "enforcer_lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/ndx-dynamodb-billing-enforcer"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Component" = "DynamoDB-Billing-Enforcer"
        }
      + tags_all                    = {
          + "Component"   = "DynamoDB-Billing-Enforcer"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_lambda_function.enforcer will be created
  + resource "aws_lambda_function" "enforcer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/dynamodb-billing-enforcer/lambda.zip"
      + function_name                  = "ndx-dynamodb-billing-enforcer"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::955063685555:role/ndx-dynamodb-billing-enforcer"
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "MEh7ettZ0+Dp6ncALBl8kc2psX6x0oE6GWFipwyI1hk="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Component" = "DynamoDB-Billing-Enforcer"
        }
      + tags_all                       = {
          + "Component"   = "DynamoDB-Billing-Enforcer"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EVENTBRIDGE_SOURCE"    = "ndx.dynamodb-billing-enforcer"
              + "EVENT_BUS_NAME"        = "default"
              + "EXEMPT_TABLE_PREFIXES" = ""
              + "SNS_TOPIC_ARN"         = "arn:aws:sns:us-east-1:955063685555:ndx-sandbox-budget-alerts"
            }
        }
    }

  # module.dynamodb_billing_enforcer[0].aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ndx-dynamodb-billing-enforcer"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = "arn:aws:events:us-east-1:955063685555:rule/ndx-dynamodb-billing-enforcer"
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.scp_manager.aws_organizations_policy.cost_avoidance will be updated in-place
  ~ resource "aws_organizations_policy" "cost_avoidance" {
      ~ content     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Sid       = "DenyLargeEC2Instances" -> "DenyUnallowedEC2InstanceTypes"
                        # (4 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action    = [
                          - "sagemaker:CreateEndpoint",
                          - "sagemaker:CreateEndpointConfig",
                          - "sagemaker:CreateTrainingJob",
                          - "sagemaker:CreateHyperParameterTuningJob",
                          - "elasticmapreduce:RunJobFlow",
                          - "gamelift:CreateFleet",
                          - "redshift:CreateCluster",
                          + "ec2:RunInstances",
                        ]
                      ~ Condition = {
                          + "ForAnyValue:StringLike" = {
                              + "ec2:InstanceType" = [
                                  + "p2.*",
                                  + "p3.*",
                                  + "p4d.*",
                                  + "p4de.*",
                                  + "p5.*",
                                  + "g3.*",
                                  + "g3s.*",
                                  + "g4dn.*",
                                  + "g4ad.*",
                                  + "g5.*",
                                  + "g5g.*",
                                  + "g6.*",
                                  + "inf1.*",
                                  + "inf2.*",
                                  + "trn1.*",
                                  + "trn1n.*",
                                  + "trn2.*",
                                  + "dl1.*",
                                  + "dl2q.*",
                                  + "u-6tb1.*",
                                  + "u-9tb1.*",
                                  + "u-12tb1.*",
                                  + "u-18tb1.*",
                                  + "u-24tb1.*",
                                  + "*.metal",
                                  + "*.metal-24xl",
                                  + "*.metal-48xl",
                                  + "*.12xlarge",
                                  + "*.16xlarge",
                                  + "*.18xlarge",
                                  + "*.24xlarge",
                                  + "*.32xlarge",
                                  + "*.48xlarge",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                      ~ Resource  = [
                          - "*",
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                      ~ Sid       = "DenyExpensiveServices" -> "DenyGPUAndLargeInstances"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike                 = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringEquals" = {
                              + "ec2:VolumeType" = [
                                  + "io1",
                                  + "io2",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                        ]
                      + Sid       = "DenyExpensiveEBSVolumeTypes"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "ec2:VolumeSize" = "500"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                        ]
                      + Sid       = "DenyLargeEBSVolumes"
                    },
                  + {
                      + Action    = [
                          + "rds:CreateDBInstance",
                          + "rds:CreateDBCluster",
                          + "rds:ModifyDBInstance",
                          + "rds:ModifyDBCluster",
                        ]
                      + Condition = {
                          + ArnNotLike                  = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringNotLike" = {
                              + "rds:DatabaseClass" = [
                                  + "db.t3.micro",
                                  + "db.t3.small",
                                  + "db.t3.medium",
                                  + "db.t3.large",
                                  + "db.t4g.micro",
                                  + "db.t4g.small",
                                  + "db.t4g.medium",
                                  + "db.t4g.large",
                                  + "db.m5.large",
                                  + "db.m5.xlarge",
                                  + "db.m6g.large",
                                  + "db.m6g.xlarge",
                                  + "db.m6i.large",
                                  + "db.m6i.xlarge",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyUnallowedRDSInstanceClasses"
                    },
                  + {
                      + Action    = [
                          + "rds:CreateDBInstance",
                          + "rds:ModifyDBInstance",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + Bool       = {
                              + "rds:MultiAz" = "true"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyRDSMultiAZ"
                    },
                  + {
                      + Action    = [
                          + "rds:CreateDBInstanceReadReplica",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyRDSReadReplicas"
                    },
                  + {
                      + Action    = [
                          + "rds:CreateDBInstance",
                          + "rds:ModifyDBInstance",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "rds:Piops" = "0"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyRDSProvisionedIOPS"
                    },
                  + {
                      + Action    = [
                          + "elasticache:CreateCacheCluster",
                          + "elasticache:CreateReplicationGroup",
                          + "elasticache:ModifyCacheCluster",
                          + "elasticache:ModifyReplicationGroup",
                        ]
                      + Condition = {
                          + ArnNotLike                              = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringNotEqualsIgnoreCase" = {
                              + "elasticache:CacheNodeType" = [
                                  + "cache.t3.micro",
                                  + "cache.t3.small",
                                  + "cache.t3.medium",
                                  + "cache.t4g.micro",
                                  + "cache.t4g.small",
                                  + "cache.t4g.medium",
                                  + "cache.m5.large",
                                  + "cache.m6g.large",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyUnallowedElastiCacheNodeTypes"
                    },
                  + {
                      + Action    = [
                          + "lambda:PutProvisionedConcurrencyConfig",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyLambdaProvisionedConcurrency"
                    },
                    {
                        Action    = [
                            "eks:CreateNodegroup",
                            "eks:UpdateNodegroupConfig",
                        ]
                        Condition = {
                            ArnNotLike         = {
                                "aws:PrincipalARN" = [
                                    "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                    "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                    "arn:aws:iam::*:role/stacksets-exec-*",
                                    "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                            NumericGreaterThan = {
                                "eks:maxSize" = "5"
                            }
                        }
                        Effect    = "Deny"
                        Resource  = [
                            "*",
                        ]
                        Sid       = "LimitEKSNodegroupSize"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:CreateAutoScalingGroup",
                          + "autoscaling:UpdateAutoScalingGroup",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "autoscaling:MaxSize" = "10"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "LimitAutoScalingGroupSize"
                    },
                  + {
                      + Action   = [
                          + "sagemaker:CreateEndpoint",
                          + "sagemaker:CreateEndpointConfig",
                          + "sagemaker:CreateTrainingJob",
                          + "sagemaker:CreateHyperParameterTuningJob",
                          + "elasticmapreduce:RunJobFlow",
                          + "gamelift:CreateFleet",
                          + "redshift:CreateCluster",
                        ]
                      + Effect   = "Deny"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "DenyExpensiveManagedServices"
                    },
                  + {
                      + Action   = [
                          + "kafka:CreateCluster",
                          + "kafka:CreateClusterV2",
                          + "fsx:CreateFileSystem",
                          + "kinesis:CreateStream",
                          + "quicksight:CreateUser",
                          + "quicksight:RegisterUser",
                          + "ec2:AllocateDedicatedHosts",
                          + "ec2:PurchaseReservedInstancesOffering",
                          + "rds:PurchaseReservedDBInstancesOffering",
                          + "elasticache:PurchaseReservedCacheNodesOffering",
                          + "savingsplans:CreateSavingsPlan",
                          + "neptune:CreateDBCluster",
                          + "neptune:CreateDBInstance",
                          + "docdb:CreateDBCluster",
                          + "docdb:CreateDBInstance",
                          + "memorydb:CreateCluster",
                          + "es:CreateDomain",
                          + "es:CreateElasticsearchDomain",
                          + "opensearch:CreateDomain",
                          + "batch:CreateComputeEnvironment",
                          + "glue:CreateJob",
                          + "glue:CreateDevEndpoint",
                          + "elasticfilesystem:CreateFileSystem",
                          + "timestream:CreateDatabase",
                          + "timestream:CreateTable",
                          + "qldb:CreateLedger",
                        ]
                      + Effect   = "Deny"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "DenyAdditionalExpensiveServices"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ description = "SCP to prevent runaway costs by limiting instance sizes and expensive operations. MANAGED BY TERRAFORM." -> "Comprehensive cost controls: EC2, RDS, EBS, ElastiCache, Lambda, and expensive services. MANAGED BY TERRAFORM."
        id          = "p-ozmh7axs"
        name        = "InnovationSandboxCostAvoidanceScp"
        tags        = {
            "Component" = "SCP-Overrides"
        }
        # (3 unchanged attributes hidden)
    }

  # module.service_quotas.aws_servicequotas_template.apigateway_throttle_rate["us-east-1"] will be created
  + resource "aws_servicequotas_template" "apigateway_throttle_rate" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8A5B8E40"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "apigateway"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 100
    }

  # module.service_quotas.aws_servicequotas_template.apigateway_throttle_rate["us-west-2"] will be created
  + resource "aws_servicequotas_template" "apigateway_throttle_rate" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8A5B8E40"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "apigateway"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 100
    }

  # module.service_quotas.aws_servicequotas_template.bedrock_anthropic_tokens["us-east-1"] will be created
  + resource "aws_servicequotas_template" "bedrock_anthropic_tokens" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F5FA8D9D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "bedrock"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5000
    }

  # module.service_quotas.aws_servicequotas_template.bedrock_anthropic_tokens["us-west-2"] will be created
  + resource "aws_servicequotas_template" "bedrock_anthropic_tokens" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F5FA8D9D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "bedrock"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5000
    }

  # module.service_quotas.aws_servicequotas_template.cloudwatch_log_groups["us-east-1"] will be created
  + resource "aws_servicequotas_template" "cloudwatch_log_groups" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-D2832119"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "logs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 50
    }

  # module.service_quotas.aws_servicequotas_template.cloudwatch_log_groups["us-west-2"] will be created
  + resource "aws_servicequotas_template" "cloudwatch_log_groups" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-D2832119"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "logs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 50
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_read_capacity["us-east-1"] will be created
  + resource "aws_servicequotas_template" "dynamodb_read_capacity" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8C6F19B1"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1000
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_read_capacity["us-west-2"] will be created
  + resource "aws_servicequotas_template" "dynamodb_read_capacity" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8C6F19B1"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1000
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_table_count["us-east-1"] will be created
  + resource "aws_servicequotas_template" "dynamodb_table_count" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F98FE922"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 50
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_table_count["us-west-2"] will be created
  + resource "aws_servicequotas_template" "dynamodb_table_count" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F98FE922"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 50
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_write_capacity["us-east-1"] will be created
  + resource "aws_servicequotas_template" "dynamodb_write_capacity" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F4C74B24"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1000
    }

  # module.service_quotas.aws_servicequotas_template.dynamodb_write_capacity["us-west-2"] will be created
  + resource "aws_servicequotas_template" "dynamodb_write_capacity" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-F4C74B24"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "dynamodb"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1000
    }

  # module.service_quotas.aws_servicequotas_template.ebs_io1_iops["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ebs_io1_iops" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-B3A130E6"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ebs_io1_iops["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ebs_io1_iops" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-B3A130E6"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ebs_io2_iops["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ebs_io2_iops" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8D977E7E"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ebs_io2_iops["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ebs_io2_iops" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-8D977E7E"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ebs_storage_gp2["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ebs_storage_gp2" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-D18FCD1D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1
    }

  # module.service_quotas.aws_servicequotas_template.ebs_storage_gp2["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ebs_storage_gp2" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-D18FCD1D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1
    }

  # module.service_quotas.aws_servicequotas_template.ebs_storage_gp3["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ebs_storage_gp3" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-7A658B76"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1
    }

  # module.service_quotas.aws_servicequotas_template.ebs_storage_gp3["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ebs_storage_gp3" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-7A658B76"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ebs"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 1
    }

  # module.service_quotas.aws_servicequotas_template.ec2_gpu_vcpus["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ec2_gpu_vcpus" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-DB2E81BA"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 4
    }

  # module.service_quotas.aws_servicequotas_template.ec2_gpu_vcpus["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ec2_gpu_vcpus" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-DB2E81BA"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 4
    }

  # module.service_quotas.aws_servicequotas_template.ec2_high_mem_vcpus["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ec2_high_mem_vcpus" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-43DA4232"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_high_mem_vcpus["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ec2_high_mem_vcpus" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-43DA4232"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_inf_vcpus["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ec2_inf_vcpus" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-1945E190"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_inf_vcpus["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ec2_inf_vcpus" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-1945E190"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_on_demand_vcpus["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ec2_on_demand_vcpus" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-1216C47A"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 64
    }

  # module.service_quotas.aws_servicequotas_template.ec2_on_demand_vcpus["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ec2_on_demand_vcpus" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-1216C47A"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 64
    }

  # module.service_quotas.aws_servicequotas_template.ec2_p_vcpus["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ec2_p_vcpus" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-417A185B"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_p_vcpus["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ec2_p_vcpus" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-417A185B"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_trn_vcpus["us-east-1"] will be created
  + resource "aws_servicequotas_template" "ec2_trn_vcpus" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-2C49D5F8"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.ec2_trn_vcpus["us-west-2"] will be created
  + resource "aws_servicequotas_template" "ec2_trn_vcpus" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-2C49D5F8"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.eks_clusters["us-east-1"] will be created
  + resource "aws_servicequotas_template" "eks_clusters" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-1194D53C"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "eks"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 2
    }

  # module.service_quotas.aws_servicequotas_template.eks_clusters["us-west-2"] will be created
  + resource "aws_servicequotas_template" "eks_clusters" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-1194D53C"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "eks"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 2
    }

  # module.service_quotas.aws_servicequotas_template.elastic_ips["us-east-1"] will be created
  + resource "aws_servicequotas_template" "elastic_ips" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-0263D0A3"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5
    }

  # module.service_quotas.aws_servicequotas_template.elastic_ips["us-west-2"] will be created
  + resource "aws_servicequotas_template" "elastic_ips" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-0263D0A3"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "ec2"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5
    }

  # module.service_quotas.aws_servicequotas_template.elasticache_nodes["us-east-1"] will be created
  + resource "aws_servicequotas_template" "elasticache_nodes" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-9B87FA9D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "elasticache"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 10
    }

  # module.service_quotas.aws_servicequotas_template.elasticache_nodes["us-west-2"] will be created
  + resource "aws_servicequotas_template" "elasticache_nodes" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-9B87FA9D"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "elasticache"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 10
    }

  # module.service_quotas.aws_servicequotas_template.kinesis_shards["us-east-1"] will be created
  + resource "aws_servicequotas_template" "kinesis_shards" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-53A1086E"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "kinesis"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.kinesis_shards["us-west-2"] will be created
  + resource "aws_servicequotas_template" "kinesis_shards" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-53A1086E"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "kinesis"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.nlb_count["us-east-1"] will be created
  + resource "aws_servicequotas_template" "nlb_count" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-69A177A2"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "elasticloadbalancing"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5
    }

  # module.service_quotas.aws_servicequotas_template.nlb_count["us-west-2"] will be created
  + resource "aws_servicequotas_template" "nlb_count" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-69A177A2"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "elasticloadbalancing"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5
    }

  # module.service_quotas.aws_servicequotas_template.rds_instances["us-east-1"] will be created
  + resource "aws_servicequotas_template" "rds_instances" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-7B6409FD"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "rds"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5
    }

  # module.service_quotas.aws_servicequotas_template.rds_instances["us-west-2"] will be created
  + resource "aws_servicequotas_template" "rds_instances" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-7B6409FD"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "rds"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 5
    }

  # module.service_quotas.aws_servicequotas_template.rds_read_replicas["us-east-1"] will be created
  + resource "aws_servicequotas_template" "rds_read_replicas" {
      + aws_region   = "us-east-1"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-5BC124EF"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "rds"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.rds_read_replicas["us-west-2"] will be created
  + resource "aws_servicequotas_template" "rds_read_replicas" {
      + aws_region   = "us-west-2"
      + global_quota = (known after apply)
      + id           = (known after apply)
      + quota_code   = "L-5BC124EF"
      + quota_name   = (known after apply)
      + region       = (known after apply)
      + service_code = "rds"
      + service_name = (known after apply)
      + unit         = (known after apply)
      + value        = 0
    }

  # module.service_quotas.aws_servicequotas_template.rds_storage["us-east-1"] will be created
  + resource "aws_servicequotas_template" "rds_storage" {
      + aws_region   = "us-east-1"
      + global_quota = (known after 

... (truncated, see workflow logs for full output)
```

</details>

*Pushed by: @gjarzebak95, Action: `pull_request`*